---
kind: property
id: P:Autodesk.Revit.DB.FamilyParameterSet.Size
source: html/49bf7a1c-b8d5-0a5d-8a33-bf74bc23eb9b.htm
---
# Autodesk.Revit.DB.FamilyParameterSet.Size Property

Returns the number of objects that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```